src/Documents/Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Взаимодействие</Name>
			<Comment>Взаимодействие</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийЗвонокАбонент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийЗвонокНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗаписьНаСледующийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ВариантыНапоминаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыНапоминаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСобытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВремяОтносительноСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПосещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВМоментСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийВзаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаимодействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Визит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Встреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонокВходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонокИсходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмоВходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмоИсходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Взаимодействие/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата                    = ТекущаяДата();
	ЗадачаСрокВыполнения    = Дата;
	НапоминаниеИспользовать = Ложь;
	НапоминаниеРежим        = Перечисления.ВариантыНапоминаний.ЗаВремяОтносительноСобытия;
	ВидОперации   			= Перечисления.ВидыОперацийВзаимодействия.ТелефонныйЗвонокВходящий;
	// На основании документа взаимодействия
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Взаимодействие") Тогда
		
		ЗаполнитьНаОснованииВзаимодействия(ДанныеЗаполнения);
		
		// На основании переданной структуры данных	 
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		// ВидОперации   = ?(ДанныеЗаполнения.Свойство("ВидОперации"), ДанныеЗаполнения.ВидОперации, ВидОперации);
		ЗадачаПредмет = ?(ДанныеЗаполнения.Свойство("Предмет"), ДанныеЗаполнения.Предмет, ЗадачаПредмет);
		
		Если ДанныеЗаполнения.Свойство("НаОсновании") Тогда			
			ЗаполнитьНаОснованииВзаимодействия(ДанныеЗаполнения.НаОсновании);		
		КонецЕсли;
		
	КонецЕсли;		 
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Обработка перед записью объекта на сервере
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	

	// Если во взаимодействие вид операции входящий звонок он по умолчанию отработан
	Если ВидОперации = Перечисления.ВидыОперацийВзаимодействия.ТелефонныйЗвонокВходящий Тогда
		ЗадачаОтработана = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик при записи объекта
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	

	Заглушка = Истина; // Заглушка, чтобы не было пустого обработчика :)
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнить на основании переданного документа взаимодействие
//
Процедура ЗаполнитьНаОснованииВзаимодействия(ДокументСсылка)
	
	ТипОснования = ТипЗнч(ДокументСсылка);
	
	Если ТипОснования = Тип("ДокументСсылка.Взаимодействие") Тогда
		
		СтруктурнаяЕдиница = ДокументСсылка.СтруктурнаяЕдиница;
		АвторДокумента     = ДокументСсылка.АвторДокумента;
		ЗадачаПредмет      = ДокументСсылка.ЗадачаПредмет;
		Задача             = ДокументСсылка.Задача;
		ЗадачаОписание     = ДокументСсылка.ЗадачаОписание;
				
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
